stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_ll_i3c.h
/**
  ******************************************************************************
  * @file    stm32u3xx_ll_i3c.h
  * @author  MCD Application Team
  * @brief   Header file of I3C LL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32U3xx_LL_I3C_H
#define STM32U3xx_LL_I3C_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32u3xx.h"

/** @addtogroup STM32U3xx_LL_Driver
  * @{
  */

#if defined (I3C1) || defined (I3C2)

/** @defgroup I3C_LL I3C
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/

/* Private constants ---------------------------------------------------------*/

/* Private macros ------------------------------------------------------------*/
/** @defgroup I3C_LL_Private_Macros I3C Private Macros
  * @{
  */
/**
  * @}
  */

/* Exported types ------------------------------------------------------------*/
/** @defgroup I3C_LL_ES_CONTROLLER_BUS_CONFIG_STRUCTURE_DEFINITION I3C Controller Bus Configuration Structure definition
  * @brief    I3C LL Controller Bus Configuration Structure definition
  * @{
  */
typedef struct
{
  uint32_t SDAHoldTime;         /*!< Specifies the I3C SDA hold time.
                                     This parameter must be a value of @ref I3C_LL_EC_SDA_HOLD_TIME                   */

  uint32_t WaitTime;            /*!< Specifies the time that the main and the new controllers should wait before
                                     issuing a start.
                                     This parameter must be a value of @ref I3C_LL_EC_OWN_ACTIVITY_STATE              */

  uint8_t SCLPPLowDuration;     /*!< Specifies the I3C SCL low duration in number of kernel clock cycles
                                     in I3C push-pull phases.
                                     This parameter must be a number between Min_Data=0 and Max_Data=0xFF.            */

  uint8_t SCLI3CHighDuration;   /*!< Specifies the I3C SCL high duration in number of kernel clock cycles,
                                     used for I3C messages for I3C open-drain and push pull phases.
                                     This parameter must be a number between Min_Data=0 and Max_Data=0xFF.            */

  uint8_t SCLODLowDuration;     /*!< Specifies the I3C SCL low duration in number of kernel clock cycles in
                                     open-drain phases, used for legacy I2C commands and for I3C open-drain phases.
                                     This parameter must be a number between Min_Data=0 and Max_Data=0xFF.            */

  uint8_t SCLI2CHighDuration;   /*!< Specifies the I3C SCL high duration in number of kernel clock cycles, used
                                     for legacy I2C commands.
                                     This parameter must be a number between Min_Data=0 and Max_Data=0xFF.            */

  uint8_t BusFreeDuration;      /*!< Specifies the I3C controller duration in number of kernel clock cycles, after
                                     a stop and before a start.
                                     This parameter must be a number between Min_Data=0 and Max_Data=0xFF.            */

  uint8_t BusIdleDuration;      /*!< Specifies the I3C controller duration in number of kernel clock cycles to be
                                     elapsed, after that both SDA and SCL are continuously high and stable
                                     before issuing a hot-join event.
                                     This parameter must be a number between Min_Data=0 and Max_Data=0xFF.            */
} LL_I3C_CtrlBusConfTypeDef;
/**
  * @}
  */

/** @defgroup I3C_LL_ES_TARGET_BUS_CONFIG_STRUCTURE_DEFINITION I3C Target Bus Configuration Structure definition
  * @brief    I3C LL Target Bus Configuration Structure definition
  * @{
  */
typedef struct
{
  uint8_t BusAvailableDuration; /*!< Specifies the I3C target duration in number of kernel clock cycles, when
                                     the SDA and the SCL are high for at least taval.
                                     This parameter must be a number between Min_Data=0 and Max_Data=0xFF.            */
} LL_I3C_TgtBusConfTypeDef;
/**
  * @}
  */
#if defined(USE_FULL_LL_DRIVER)

/** @defgroup I3C_LL_ES_INIT I3C Exported Init structure
  * @brief    I3C LL Init Structure definition
  * @{
  */
typedef struct
{
  LL_I3C_CtrlBusConfTypeDef CtrlBusCharacteristic; /*!< Specifies the I3C controller bus characteristic configuration
                                                        when Controller mode                                          */

  LL_I3C_TgtBusConfTypeDef  TgtBusCharacteristic;  /*!< Specifies the I3C target bus characteristic configuration
                                                        when Target mode                                              */

} LL_I3C_InitTypeDef;
/**
  * @}
  */
#endif /* USE_FULL_LL_DRIVER */

/* Exported constants --------------------------------------------------------*/
/** @defgroup I3C_LL_Exported_Constants I3C Exported Constants
  * @{
  */

/** @defgroup I3C_LL_EC_GET_FLAG Get Flags Defines
  * @brief    Flags defines which can be used with LL_I3C_ReadReg function
  * @{
  */
#define LL_I3C_EVR_CFEF                    I3C_EVR_CFEF
#define LL_I3C_EVR_TXFEF                   I3C_EVR_TXFEF
#define LL_I3C_EVR_CFNFF                   I3C_EVR_CFNFF
#define LL_I3C_EVR_SFNEF                   I3C_EVR_SFNEF
#define LL_I3C_EVR_TXFNFF                  I3C_EVR_TXFNFF
#define LL_I3C_EVR_RXFNEF                  I3C_EVR_RXFNEF
#define LL_I3C_EVR_RXLASTF                 I3C_EVR_RXLASTF
#define LL_I3C_EVR_TXLASTF                 I3C_EVR_TXLASTF
#define LL_I3C_EVR_FCF                     I3C_EVR_FCF
#define LL_I3C_EVR_RXTGTENDF               I3C_EVR_RXTGTENDF
#define LL_I3C_EVR_ERRF                    I3C_EVR_ERRF
#define LL_I3C_EVR_IBIF                    I3C_EVR_IBIF
#define LL_I3C_EVR_IBIENDF                 I3C_EVR_IBIENDF
#define LL_I3C_EVR_CRF                     I3C_EVR_CRF
#define LL_I3C_EVR_CRUPDF                  I3C_EVR_CRUPDF
#define LL_I3C_EVR_HJF                     I3C_EVR_HJF
#define LL_I3C_EVR_WKPF                    I3C_EVR_WKPF
#define LL_I3C_EVR_GETF                    I3C_EVR_GETF
#define LL_I3C_EVR_STAF                    I3C_EVR_STAF
#define LL_I3C_EVR_DAUPDF                  I3C_EVR_DAUPDF
#define LL_I3C_EVR_MWLUPDF                 I3C_EVR_MWLUPDF
#define LL_I3C_EVR_MRLUPDF                 I3C_EVR_MRLUPDF
#define LL_I3C_EVR_RSTF                    I3C_EVR_RSTF
#define LL_I3C_EVR_ASUPDF                  I3C_EVR_ASUPDF
#define LL_I3C_EVR_INTUPDF                 I3C_EVR_INTUPDF
#define LL_I3C_EVR_DEFF                    I3C_EVR_DEFF
#define LL_I3C_EVR_GRPF                    I3C_EVR_GRPF
#define LL_I3C_SER_PERR                    I3C_SER_PERR
#define LL_I3C_SER_STALL                   I3C_SER_STALL
#define LL_I3C_SER_DOVR                    I3C_SER_DOVR
#define LL_I3C_SER_COVR                    I3C_SER_COVR
#define LL_I3C_SER_ANACK                   I3C_SER_ANACK
#define LL_I3C_SER_DNACK                   I3C_SER_DNACK
#define LL_I3C_SER_DERR                    I3C_SER_DERR
/**
  * @}
  */

/** @defgroup I3C_LL_EC_IT IT Defines
  * @brief    IT defines which can be used with LL_I3C_ReadReg and  LL_I3C_WriteReg functions
  * @{
  */
#define LL_I3C_IER_CFNFIE                  I3C_IER_CFNFIE
#define LL_I3C_IER_SFNEIE                  I3C_IER_SFNEIE
#define LL_I3C_IER_TXFNFIE                 I3C_IER_TXFNFIE
#define LL_I3C_IER_RXFNEIE                 I3C_IER_RXFNEIE
#define LL_I3C_IER_FCIE                    I3C_IER_FCIE
#define LL_I3C_IER_RXTGTENDIE              I3C_IER_RXTGTENDIE
#define LL_I3C_IER_ERRIE                   I3C_IER_ERRIE
#define LL_I3C_IER_IBIIE                   I3C_IER_IBIIE
#define LL_I3C_IER_IBIENDIE                I3C_IER_IBIENDIE
#define LL_I3C_IER_CRIE                    I3C_IER_CRIE
#define LL_I3C_IER_CRUPDIE                 I3C_IER_CRUPDIE
#define LL_I3C_IER_HJIE                    I3C_IER_HJIE
#define LL_I3C_IER_WKPIE                   I3C_IER_WKPIE
#define LL_I3C_IER_GETIE                   I3C_IER_GETIE
#define LL_I3C_IER_STAIE                   I3C_IER_STAIE
#define LL_I3C_IER_DAUPDIE                 I3C_IER_DAUPDIE
#define LL_I3C_IER_MWLUPDIE                I3C_IER_MWLUPDIE
#define LL_I3C_IER_MRLUPDIE                I3C_IER_MRLUPDIE
#define LL_I3C_IER_RSTIE                   I3C_IER_RSTIE
#define LL_I3C_IER_ASUPDIE                 I3C_IER_ASUPDIE
#define LL_I3C_IER_INTUPDIE                I3C_IER_INTUPDIE
#define LL_I3C_IER_DEFIE                   I3C_IER_DEFIE
#define LL_I3C_IER_GRPIE                   I3C_IER_GRPIE
/**
  * @}
  */

/** @defgroup I3C_LL_EC_MASK_IT MASKS IT Defines
  * @brief    Masks Interrupt defines which can be used with LL_I3C_ReadReg and  LL_I3C_WriteReg functions
  * @{
  */
#define LL_I3C_MISR_CFNFMIS                I3C_MISR_CFNFMIS
#define LL_I3C_MISR_SFNEMIS                I3C_MISR_SFNEMIS
#define LL_I3C_MISR_TXFNFMIS               I3C_MISR_TXFNFMIS
#define LL_I3C_MISR_RXFNEMIS               I3C_MISR_RXFNEMIS
#define LL_I3C_MISR_FCMIS                  I3C_MISR_FCMIS
#define LL_I3C_MISR_RXTGTENDMIS            I3C_MISR_RXTGTENDMIS
#define LL_I3C_MISR_ERRMIS                 I3C_MISR_ERRMIS
#define LL_I3C_MISR_IBIMIS                 I3C_MISR_IBIMIS
#define LL_I3C_MISR_IBIENDMIS              I3C_MISR_IBIENDMIS
#define LL_I3C_MISR_CRMIS                  I3C_MISR_CRMIS
#define LL_I3C_MISR_CRUPDMIS               I3C_MISR_CRUPDMIS
#define LL_I3C_MISR_HJMIS                  I3C_MISR_HJMIS
#define LL_I3C_MISR_WKPMIS                 I3C_MISR_WKPMIS
#define LL_I3C_MISR_GETMIS                 I3C_MISR_GETMIS
#define LL_I3C_MISR_STAMIS                 I3C_MISR_STAMIS
#define LL_I3C_MISR_DAUPDMIS               I3C_MISR_DAUPDMIS
#define LL_I3C_MISR_MWLUPDMIS              I3C_MISR_MWLUPDMIS
#define LL_I3C_MISR_MRLUPDMIS              I3C_MISR_MRLUPDMIS
#define LL_I3C_MISR_RSTMIS                 I3C_MISR_RSTMIS
#define LL_I3C_MISR_ASUPDMIS               I3C_MISR_ASUPDMIS
#define LL_I3C_MISR_INTUPDMIS              I3C_MISR_INTUPDMIS
#define LL_I3C_MISR_DEFMIS                 I3C_MISR_DEFMIS
#define LL_I3C_MISR_GRPMIS                 I3C_MISR_GRPMIS
/**
  * @}
  */

