stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_ll_i3c.h
/** @defgroup I3C_LL_EC_MODE MODE
  * @{
  */
#define LL_I3C_MODE_CONTROLLER              I3C_CFGR_CRINIT         /*!< I3C Controller mode */
#define LL_I3C_MODE_TARGET                  0x00000000U             /*!< I3C Target (Controller capable) mode */
/**
  * @}
  */

/** @defgroup I3C_LL_EC_DMA_REG_DATA DMA Register Data
  * @{
  */
#define LL_I3C_DMA_REG_DATA_TRANSMIT_BYTE   0x00000000U              /*!< Get address of data register used
                                                                          for transmission in Byte */
#define LL_I3C_DMA_REG_DATA_RECEIVE_BYTE    0x00000001U              /*!< Get address of data register used
                                                                          for reception in Byte */
#define LL_I3C_DMA_REG_DATA_TRANSMIT_WORD   0x00000002U              /*!< Get address of data register used for
                                                                          transmission in Word */
#define LL_I3C_DMA_REG_DATA_RECEIVE_WORD    0x00000003U              /*!< Get address of data register used
                                                                          for reception in Word */
#define LL_I3C_DMA_REG_STATUS               0x00000004U              /*!< Get address of status register used
                                                                          for transfer status in Word */
#define LL_I3C_DMA_REG_CONTROL              0x00000005U              /*!< Get address of control register used
                                                                          for transfer control in Word */
/**
  * @}
  */

/** @defgroup I3C_LL_EC_RX_THRESHOLD RX THRESHOLD
  * @{
  */
#define LL_I3C_RXFIFO_THRESHOLD_1_4         0x00000000U
/*!< Rx Fifo Threshold is 1 byte in a Fifo depth of 4 bytes */
#define LL_I3C_RXFIFO_THRESHOLD_4_4         I3C_CFGR_RXTHRES
/*!< Rx Fifo Threshold is 4 bytes in a Fifo depth of 4 bytes */
/**
  * @}
  */

/** @defgroup I3C_LL_EC_TX_THRESHOLD TX THRESHOLD
  * @{
  */
#define LL_I3C_TXFIFO_THRESHOLD_1_4         0x00000000U
/*!< Tx Fifo Threshold is 1 byte in a Fifo depth of 4 bytes */
#define LL_I3C_TXFIFO_THRESHOLD_4_4         I3C_CFGR_TXTHRES
/*!< Tx Fifo Threshold is 4 bytes in a Fifo depth of 4 bytes */
/**
  * @}
  */

/** @defgroup I3C_LL_EC_TRIGSRCSEL  Trigger source selection
  * @brief    I3C Trigger source selection
  * @{
  */
#define LL_I3C_TRIG_GRP1                   (0x10000000U)         /*!< Trigger Group for I3C1, I3C2 */

#define LL_I3C_GRP1_GPDMA_CH0_TCF_TRG      (uint32_t)(LL_I3C_TRIG_GRP1 | (0x00000000U))
/*!< HW Trigger signal is GPDMA_CH0_TRG     */
#define LL_I3C_GRP1_GPDMA_CH1_TCF_TRG      (uint32_t)(LL_I3C_TRIG_GRP1 | (0x1U << I3C_CFGR_TRIGSEL_Pos))
/*!< HW Trigger signal is GPDMA_CH1_TRG     */
#define LL_I3C_GRP1_GPDMA_CH2_TCF_TRG      (uint32_t)(LL_I3C_TRIG_GRP1 | (0x2U << I3C_CFGR_TRIGSEL_Pos))
/*!< HW Trigger signal is GPDMA_CH2_TRG     */
#define LL_I3C_GRP1_GPDMA_CH3_TCF_TRG      (uint32_t)(LL_I3C_TRIG_GRP1 | (0x3U << I3C_CFGR_TRIGSEL_Pos))
/*!< HW Trigger signal is GPDMA_CH3_TRG     */
#define LL_I3C_GRP1_EXTI5_TRG              (uint32_t)(LL_I3C_TRIG_GRP1 | (0x4U << I3C_CFGR_TRIGSEL_Pos))
/*!< HW Trigger signal is EXTI5_TRG         */
#define LL_I3C_GRP1_EXTI9_TRG              (uint32_t)(LL_I3C_TRIG_GRP1 | (0x5U << I3C_CFGR_TRIGSEL_Pos))
/*!< HW Trigger signal is EXTI9_TRG         */
#define LL_I3C_GRP1_LPTIM1_CH1_TRG         (uint32_t)(LL_I3C_TRIG_GRP1 | (0x6U << I3C_CFGR_TRIGSEL_Pos))
/*!< HW Trigger signal is LPTIM1_CH1_TRG    */
#define LL_I3C_GRP1_LPTIM2_CH1_TRG         (uint32_t)(LL_I3C_TRIG_GRP1 | (0x7U << I3C_CFGR_TRIGSEL_Pos))
/*!< HW Trigger signal is LPTIM2_CH1_TRG    */
#define LL_I3C_GRP1_COMP1_TRG              (uint32_t)(LL_I3C_TRIG_GRP1 | (0x8U << I3C_CFGR_TRIGSEL_Pos))
/*!< HW Trigger signal is COMP1_TRG         */
#define LL_I3C_GRP1_COMP2_TRG              (uint32_t)(LL_I3C_TRIG_GRP1 | (0x9U << I3C_CFGR_TRIGSEL_Pos))
/*!< HW Trigger signal is COMP2_TRG         */
#define LL_I3C_GRP1_RTC_ALRA_TRG           (uint32_t)(LL_I3C_TRIG_GRP1 | (0xAU << I3C_CFGR_TRIGSEL_Pos))
/*!< HW Trigger signal is RTC_ALRA_TRG      */
#define LL_I3C_GRP1_RTC_WUT_TRG            (uint32_t)(LL_I3C_TRIG_GRP1 | (0xBU << I3C_CFGR_TRIGSEL_Pos))
/*!< HW Trigger signal is RTC_WUT_TRG       */
#define LL_I3C_GRP1_TIM15_TGO_CKTIM_TRG    (uint32_t)(LL_I3C_TRIG_GRP1 | (0xCU << I3C_CFGR_TRIGSEL_Pos))
/*!< HW Trigger signal is TIM15_TGO_CKTIM_TRG */
#define LL_I3C_GRP1_TIM16_OC1_TRG          (uint32_t)(LL_I3C_TRIG_GRP1 | (0xDU << I3C_CFGR_TRIGSEL_Pos))
/*!< HW Trigger signal is TIM16_OC1_TRG     */
/**
  * @}
  */

/** @defgroup I3C_LL_EC_TRIG TRIG
  * @{
  */
#define LL_I3C_TRIG_LOW                    0x00000000U               /*!< Trigger is active when signal is 0 */
#define LL_I3C_TRIG_HIGH                   I3C_CFGR_TRIGPOL          /*!< Trigger is active when signal is 1 */
/**
  * @}
  */

/** @defgroup I3C_LL_EC_End_Of_FrameCompletion End of Frame completion
  * @{
  */
#define LL_I3C_END_OF_FRAME_CPLT_DISABLE   I3C_CFGR_FCFDIS
/*!< Frame Completion Flag is autoclear by HW, no need SW action */
#define LL_I3C_END_OF_FRAME_CPLT_ENABLE    0x00000000U
/*!< Frame Completion Flag need to be clear by SW action (default configuration) */
/**
  * @}
  */

/** @defgroup I3C_LL_EC_PAYLOAD PAYLOAD
  * @{
  */
#define LL_I3C_PAYLOAD_EMPTY               0x00000000U
/*!< Empty payload, no additional data after IBI acknowledge */
#define LL_I3C_PAYLOAD_1_BYTE              I3C_MAXRLR_IBIP_0
/*!< One additional data byte after IBI acknowledge */
#define LL_I3C_PAYLOAD_2_BYTES             I3C_MAXRLR_IBIP_1
/*!< Two additional data bytes after IBI acknowledge */
#define LL_I3C_PAYLOAD_3_BYTES             (I3C_MAXRLR_IBIP_1 | I3C_MAXRLR_IBIP_0)
/*!< Three additional data bytes after IBI acknowledge */
#define LL_I3C_PAYLOAD_4_BYTES             I3C_MAXRLR_IBIP_2
/*!< Four additional data bytes after IBI acknowledge */
/**
  * @}
  */

/** @defgroup I3C_LL_EC_SDA_HOLD_TIME SDA HOLD TIME 0
  * @{
  */
#define LL_I3C_SDA_HOLD_TIME_0_5           0x00000000U
/*!< SDA hold time is 0.5 x ti3cclk */
#define LL_I3C_SDA_HOLD_TIME_1_5           I3C_TIMINGR1_SDA_HD_0
/*!< SDA hold time is 1.5 x ti3cclk */
#define LL_I3C_SDA_HOLD_TIME_2_5           I3C_TIMINGR1_SDA_HD_1
/*!< SDA hold time is 2.5 x ti3cclk */
#define LL_I3C_SDA_HOLD_TIME_3_5           (I3C_TIMINGR1_SDA_HD_1 | I3C_TIMINGR1_SDA_HD_0)
/*!< SDA hold time is 3.5 x ti3cclk */
/**
  * @}
  */

/** @defgroup I3C_LL_EC_OWN_ACTIVITY_STATE OWN ACTIVITY STATE
  * @{
  */
#define LL_I3C_OWN_ACTIVITY_STATE_0        0x00000000U
/*!< Own Controller Activity state 0 */
#define LL_I3C_OWN_ACTIVITY_STATE_1        I3C_TIMINGR1_ASNCR_0
/*!< Own Controller Activity state 1 */
#define LL_I3C_OWN_ACTIVITY_STATE_2        I3C_TIMINGR1_ASNCR_1
/*!< Own Controller Activity state 2 */
#define LL_I3C_OWN_ACTIVITY_STATE_3        (I3C_TIMINGR1_ASNCR_1 | I3C_TIMINGR1_ASNCR_0)
/*!< Own Controller Activity state 3 */
/**
  * @}
  */

/** @defgroup I3C_LL_EC_DEVICE_ROLE_AS DEVICE ROLE AS
  * @{
  */
#define LL_I3C_DEVICE_ROLE_AS_TARGET        0x00000000U              /*!< I3C Target */
#define LL_I3C_DEVICE_ROLE_AS_CONTROLLER    I3C_BCR_BCR6             /*!< I3C Controller */
/**
  * @}
  */

/** @defgroup I3C_LL_EC_IBI_NO_ADDITIONAL IBI NO ADDITIONAL
  * @{
  */
#define LL_I3C_IBI_NO_ADDITIONAL_DATA      0x00000000U               /*!< No data byte follows the accepted IBI */
#define LL_I3C_IBI_ADDITIONAL_DATA         I3C_BCR_BCR2              /*!< A Mandatory Data Byte (MDB)
                                                                          follows the accepted IBI */
/**
  * @}
  */

